from django.test import TestCase

t = "Идейные соображения высшего порядка, а также постоянный количественный рост и сфера нашей активности позволяет " \
    "оценить значение систем массового участия. Разнообразный и богатый опыт консультация с широким активом позволяет " \
    "оценить значение направлений прогрессивного развития" \
    "Разнообразный и богатый опыт новая модель организационной деятельности позволяет выполнять важные задания по " \
    "разработке модели развития. Равным образом укрепление и развитие структуры играет важную роль в формировании " \
    "форм развития. Повседневная практика показывает, что рамки и место обучения кадров позволяет выполнять важные " \
    "задания по разработке системы обучения кадров, соответствует насущным потребностям" \
    "Значимость этих проблем настолько очевидна, что укрепление и развитие структуры способствует подготовки и " \
    "реализации форм развития. Идейные соображения высшего порядка, а также постоянное информационно-пропагандистское " \
    "обеспечение нашей деятельности требуют определения и уточнения новых предложений. Повседневная практика " \
    "показывает, что сложившаяся структура организации обеспечивает широкому кругу (специалистов) участие в " \
    "формировании направлений прогрессивного развития. Повседневная практика показывает, что укрепление и развитие " \
    "структуры требуют определения и уточнения позиций, занимаемых участниками в отношении поставленных задач. " \
    "Идейные соображения высшего порядка, а также реализация намеченных плановых заданий влечет за собой процесс " \
    "внедрения и модернизации систем массового участия"

print(t[: 120] + '...')
